# Setup

In [2]:
import pandas as pd

# Reading and Writing

In [3]:
df = pd.read_csv("..//data//summiters.csv")

# Data Frame Baiscs

In [4]:
pd.set_option("display.max_columns", 50)

## Show shape

In [15]:
df.shape

(30679, 12)

## Show columns

In [7]:
df.columns

Index(['peak_id', 'peak_name', 'name', 'yr_season', 'date', 'time',
       'citizenship', 'gender', 'age', 'is_o2_used', 'died_on_descent',
       'host_country'],
      dtype='object')

## Show rows

In [8]:
df.index

RangeIndex(start=0, stop=30679, step=1)

## Show first n rows

In [5]:
df.head(10)

,peak_id,peak_name,name,yr_season,date,time,citizenship,gender,age,is_o2_used,died_on_descent,host_country
0,ACHN,Aichyn,Kaya Ko,2015 Aut,Sep 03,13:15,Japan,F,23,No,.,Nepal
1,ACHN,Aichyn,Yuma Ono,2015 Aut,Sep 03,13:15,Japan,M,19,No,.,Nepal
2,ACHN,Aichyn,Shintaro Saito,2015 Aut,Sep 03,13:15,Japan,M,25,No,.,Nepal
3,ACHN,Aichyn,Hiroki (Yuki) Senda,2015 Aut,Sep 03,13:15,Japan,M,23,No,.,Nepal
4,ACHN,Aichyn,Yuto Tamaki,2015 Aut,Sep 03,13:15,Japan,M,22,No,.,Nepal
5,ACHN,Aichyn,"Rajan Lama Bhote (Hatiya-1, Makalu-Barun)",2015 Aut,Sep 25,13:30,Nepal,M,28,No,.,Nepal
6,ACHN,Aichyn,Jean-Paul Emole Gabriel Charpentier,2015 Aut,Sep 25,13:30,France,M,60,No,.,Nepal
7,ACHN,Aichyn,Pierre Robert Roger Derieux,2015 Aut,Sep 25,13:30,France,M,50,No,.,Nepal
8,ACHN,Aichyn,Paul Marc (Paulo) Grobel,2015 Aut,Sep 25,13:30,France,M,58,No,.,Nepal
9,ACHN,Aichyn,Dhan Bahadur Magar,2015 Aut,Sep 25,13:30,Nepal,M,29,No,.,Nepal

## Show last n rows

In [6]:
df.tail(10)

,peak_id,peak_name,name,yr_season,date,time,citizenship,gender,age,is_o2_used,died_on_descent,host_country
30669,YALU,Yalung Kang,Ang Dawa Sherpa (Solukhumbu),1989 Win,Dec 20,16:05,Nepal,M,29,Y,Y,Nepal
30670,YALU,Yalung Kang,Tchiring Chumbi (Tchiring Thebe) Sherpa (Nupri...,1989 Win,Dec 20,16:05,Nepal,M,36,Y,Y,Nepal
30671,YALU,Yalung Kang,"Pasang Namgyal Sherpa (Khumjung, Khumbu)",2004 Spr,May 05,15:08,Nepal,M,31,Y,.,Nepal
30672,YALU,Yalung Kang,"Phur Gyalzen (Fur Geljen) Sherpa (Yilajung, Kh...",2004 Spr,May 05,15:08,Nepal,M,34,Y,.,Nepal
30673,YALU,Yalung Kang,Hong-Gil Um,2004 Spr,May 05,15:08,S Korea,M,43,Y,.,Nepal
30674,YANK,Yanme Kang,Gregoire Jerome Lestienne,2017 Aut,Oct 29,NaN,France,M,31,No,.,Nepal
30675,YANK,Yanme Kang,Floriane Caroline Pugin,2017 Aut,Oct 29,NaN,France,F,28,No,.,Nepal
30676,YAUP,Yaupa,Andrew Robert (Andy) Fanshawe,1989 Aut,Dec 31,NaN,UK,M,26,No,.,Nepal
30677,YAUP,Yaupa,Anthony Victor (Vic) Saunders,1989 Aut,Dec 31,NaN,UK,M,39,No,.,Nepal
30678,YAUP,Yaupa,Stephen F. Sustad,1989 Aut,Dec 31,NaN,USA,M,29,No,.,Nepal

## Show information about dataframe

In [11]:
df.info() #verbose=False - summary

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30679 entries, 0 to 30678
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   peak_id          30679 non-null  object
 1   peak_name        30679 non-null  object
 2   name             30679 non-null  object
 3   yr_season        30679 non-null  object
 4   date             30679 non-null  object
 5   time             22330 non-null  object
 6   citizenship      30679 non-null  object
 7   gender           30679 non-null  object
 8   age              30679 non-null  int64
 9   is_o2_used       30679 non-null  object
 10  died_on_descent  30679 non-null  object
 11  host_country     28586 non-null  object
dtypes: int64(1), object(11)
memory usage: 2.8+ MB

## Show statistics

In [13]:
df.describe()

                age
count  30679.000000
mean      34.865804
std       11.684317
min        0.000000
25%       28.000000
50%       34.000000
75%       42.000000
max       80.000000

In [14]:
# non numerical columns
df[["peak_name"]].describe()

       peak_name
count      30679
unique       337
top      Everest
freq       10184

## Subsetting a data frame

In [16]:
df[["peak_name", "name", "date"]]

        peak_name                           name    date
0          Aichyn                        Kaya Ko  Sep 03
1          Aichyn                       Yuma Ono  Sep 03
2          Aichyn                 Shintaro Saito  Sep 03
3          Aichyn            Hiroki (Yuki) Senda  Sep 03
4          Aichyn                    Yuto Tamaki  Sep 03
...           ...                            ...     ...
30674  Yanme Kang      Gregoire Jerome Lestienne  Oct 29
30675  Yanme Kang        Floriane Caroline Pugin  Oct 29
30676       Yaupa  Andrew Robert (Andy) Fanshawe  Dec 31
30677       Yaupa  Anthony Victor (Vic) Saunders  Dec 31
30678       Yaupa              Stephen F. Sustad  Dec 31

[30679 rows x 3 columns]

In [19]:
df[df.columns[:5]] # subsetting using slicing

      peak_id   peak_name                           name yr_season    date
0        ACHN      Aichyn                        Kaya Ko  2015 Aut  Sep 03
1        ACHN      Aichyn                       Yuma Ono  2015 Aut  Sep 03
2        ACHN      Aichyn                 Shintaro Saito  2015 Aut  Sep 03
3        ACHN      Aichyn            Hiroki (Yuki) Senda  2015 Aut  Sep 03
4        ACHN      Aichyn                    Yuto Tamaki  2015 Aut  Sep 03
...       ...         ...                            ...       ...     ...
30674    YANK  Yanme Kang      Gregoire Jerome Lestienne  2017 Aut  Oct 29
30675    YANK  Yanme Kang        Floriane Caroline Pugin  2017 Aut  Oct 29
30676    YAUP       Yaupa  Andrew Robert (Andy) Fanshawe  1989 Aut  Dec 31
30677    YAUP       Yaupa  Anthony Victor (Vic) Saunders  1989 Aut  Dec 31
30678    YAUP       Yaupa              Stephen F. Sustad  1989 Aut  Dec 31

[30679 rows x 5 columns]

### Subsetting based on data types

In [20]:
df.select_dtypes("int")

       age
0       23
1       19
2       25
3       23
4       22
...    ...
30674   31
30675   28
30676   26
30677   39
30678   29

[30679 rows x 1 columns]

## Data Frame vs. Series

In [24]:
type(df[["peak_name"]]) # this is a data frame

pandas.core.frame.DataFrame

In [25]:
type(df["peak_name"]) # this is a series

pandas.core.series.Series